org/sleep.org
#+title: sleep

Currently, I do /not/ sleep well 😞...I wake up many times during the night, my back is uncomfortable, and I'm often not calm by bedtime. So here I'm collecting some concrete actions to help me sleep better.

* Principles
** Regularity
- No Naps
- Bedtime Ritual - Meditation / physical journal
- Earliest possible bedtime: 2
- Wake time: 9

** Increase Sleep Drive
- No Naps
- Get daylight + exercise
- Limit Blue light at night - journal on paper (I know, I know you don't want to...)
** Break out of Anxious Feedback Loops
- Bedtime Ritual - Meditation / physical journal
** Good Sleep Conditions
- window cracked open, less CO_2
- No clutter
** Sleep Posture
- Sleep on Back: try methods that keep me from flipping during the night.
- Sleep on Stomach: try pelvis/knee pillow
* Sleep Log
In order to quantitatively track my progress with sleep restriction, I'm keeping a sleep log that tracks my sleep efficiency, sleep/wake times, and general quality of sleep.
| Date | T_{inbed} | T_{asleep} | Bedtime | Wakeup | How I'm feeling                                                                                                                                                                                                                                                                                                                                                                                                                                                                  |
|------+-----------+------------+---------+--------+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| 4/25 |      5:50 |       5:20 |    3:10 |   9:00 | 6 - Surprisingly okay! Tired at wakeup, but run really invigorated me.                                                                                                                                                                                                                                                                                                                                                                                                           |
| 4/26 |      7:00 |       6:00 |    2:00 |   9:00 | 6 - but for different reasons than yesterday?? I guess I haven't exercised yet, that'll probably invigorate me.                                                                                                                                                                                                                                                                                                                                                                  |
| 4/27 |      6:30 |       6:20 |    2:30 |   9:00 | 8 - actually felt rested for the first time in forever...                                                                                                                                                                                                                                                                                                                                                                                                                        |
| 4/28 |      6:50 |       6:20 |    2:10 |   9:00 | 5 - Slept ok, not as good as last night.                                                                                                                                                                                                                                                                                                                                                                                                                                         |
| 4/29 |      7:00 |       6:00 |    2:00 |   9:00 | 6 - Idk why I keep rating my sleep 6, but it felt like a 6 again.                                                                                                                                                                                                                                                                                                                                                                                                                |
| 4/30 |      7:00 |       6:30 |    2:00 |   9:00 | 6.5 - positive meh....                                                                                                                                                                                                                                                                                                                                                                                                                                                           |
| 5/1  |      7:00 |       6:00 |    2:00 |   9:00 | 5 - had some major disturbances (i.e. bathroom) during the night, so I think that disrupted my sleep a fair bit.                                                                                                                                                                                                                                                                                                                                                                 |
| 5/2  |      7:30 |       7:20 |    1:30 |   9:00 | 7.5 - feel rested again! I think it may be time to try moving my sleep window back to 1:30 officially.                                                                                                                                                                                                                                                                                                                                                                           |
| 5/3  |      7:00 |       6:45 |    2:00 |   9:00 | 8 - I feel like this was my best sleep yet. Only one(?) wakeup afaik. Also, my body seems to be consistently anticipating my alarm now, as I wake up <10 minutes before it. Incredible.                                                                                                                                                                                                                                                                                          |
| 5/4  |      6:20 |       5:35 |    2:40 |   9:00 | 5 - Obviously went to bed a little late tonight, but I feel like the more major reason was that I was somewhat stressed going into bed, having not reached a good resolution with my research project, and I feel like most of my sleep was disturbed for that reason. I only got semi-decent sleep in the last hour or two. Also, I felt hot under the blankets, and my back was uncomfortable since I didn't do child pose before sleeping. Gotta remember to do those things. |
| 5/5  |      7:00 |       6:20 |    2:00 |   9:00 | 6 - was definitely better than yesterday, but the reason it's not higher is the seeming cavalcade of garbage trucks in the morning...I really need to have my headphones + brown noise handy, and also we just can't sleep with the windows open. The trucks could strike at any time.                                                                                                                                                                                           |
| 5/6  |      8:00 |       7:00 |    1:40 |   9:40 | 7 - honestly, I felt a lot more grumpy when I woke up -- now realizing that maybe I didn't sleep too badly. Well that's good. :)                                                                                                                                                                                                                                                                                                                                                 |
| 5/7  |      6:20 |       5:50 |    2:40 |   9:00 | 6 - stayed up too late, but the actual sleep wasn't terrible. A few wakeups / back discomfort.                                                                                                                                                                                                                                                                                                                                                                                   |
| 5/8  |      7:15 |       5:30 |    1:45 |   9:00 | 4 - slept ok....                                                                                                                                                                                                                                                                                                                                                                                                                                                                 |
| 5/9  |      8:40 |       7:00 |    2:00 |  10:40 | 4 - ugh, this did not feel nice. For whatever reason, screens etc., I just didn't sleep well last night.                                                                                                                                                                                                                                                                                                                                                                         |
| 5/10 |      7:15 |       6:45 |    1:45 |   9:00 | 7 - yay, feel like I slept well :) Lil bit of tiredness to shake off, but hopefully going on a run will help w that!                                                                                                                                                                                                                                                                                                                                                             |
