html/sleep.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-07-15 Thu 17:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>sleep</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Ketan Agrawal" />
<link rel="stylesheet" type="text/css" href="styles.css" />
<link rel="stylesheet" type="text/css" href="syntax.css" />
</head>
<body>
<div id="preamble" class="status">
<a style="color: inherit; text-decoration: none" href="/"><h2>Ketan's Digital Laboratory &#129514;</h2></a>
</div>
<div id="content">
<h1 class="title">sleep</h1>
<p>
Currently, I do <i>not</i> sleep well 😞&#x2026;I wake up many times during the night, my back is uncomfortable, and I&rsquo;m often not calm by bedtime. So here I&rsquo;m collecting some concrete actions to help me sleep better.<br />
</p>

<div id="outline-container-orgf159f98" class="outline-2">
<h2 id="orgf159f98">Principles</h2>
<div class="outline-text-2" id="text-orgf159f98">
</div>
<div id="outline-container-org9138f24" class="outline-3">
<h3 id="org9138f24">Regularity</h3>
<div class="outline-text-3" id="text-org9138f24">
<ul class="org-ul">
<li>No Naps<br /></li>
<li>Bedtime Ritual - Meditation / physical journal<br /></li>
<li>Earliest possible bedtime: 2<br /></li>
<li>Wake time: 9<br /></li>
</ul>
</div>
</div>

<div id="outline-container-org8442460" class="outline-3">
<h3 id="org8442460">Increase Sleep Drive</h3>
<div class="outline-text-3" id="text-org8442460">
<ul class="org-ul">
<li>No Naps<br /></li>
<li>Get daylight + exercise<br /></li>
<li>Limit Blue light at night - journal on paper (I know, I know you don&rsquo;t want to&#x2026;)<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org8a16e3a" class="outline-3">
<h3 id="org8a16e3a">Break out of Anxious Feedback Loops</h3>
<div class="outline-text-3" id="text-org8a16e3a">
<ul class="org-ul">
<li>Bedtime Ritual - Meditation / physical journal<br /></li>
</ul>
</div>
</div>
<div id="outline-container-orgf738253" class="outline-3">
<h3 id="orgf738253">Good Sleep Conditions</h3>
<div class="outline-text-3" id="text-orgf738253">
<ul class="org-ul">
<li>window cracked open, less CO<sub>2</sub><br /></li>
<li>No clutter<br /></li>
</ul>
</div>
</div>
<div id="outline-container-org4431a58" class="outline-3">
<h3 id="org4431a58">Sleep Posture</h3>
<div class="outline-text-3" id="text-org4431a58">
<ul class="org-ul">
<li>Sleep on Back: try methods that keep me from flipping during the night.<br /></li>
<li>Sleep on Stomach: try pelvis/knee pillow<br /></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgfde2194" class="outline-2">
<h2 id="orgfde2194">Sleep Log</h2>
<div class="outline-text-2" id="text-orgfde2194">
<p>
In order to quantitatively track my progress with sleep restriction, I&rsquo;m keeping a sleep log that tracks my sleep efficiency, sleep/wake times, and general quality of sleep.<br />
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Date</th>
<th scope="col" class="org-right">T<sub>inbed</sub></th>
<th scope="col" class="org-right">T<sub>asleep</sub></th>
<th scope="col" class="org-right">Bedtime</th>
<th scope="col" class="org-right">Wakeup</th>
<th scope="col" class="org-left">How I&rsquo;m feeling</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">4/25</td>
<td class="org-right">5:50</td>
<td class="org-right">5:20</td>
<td class="org-right">3:10</td>
<td class="org-right">9:00</td>
<td class="org-left">6 - Surprisingly okay! Tired at wakeup, but run really invigorated me.</td>
</tr>

<tr>
<td class="org-left">4/26</td>
<td class="org-right">7:00</td>
<td class="org-right">6:00</td>
<td class="org-right">2:00</td>
<td class="org-right">9:00</td>
<td class="org-left">6 - but for different reasons than yesterday?? I guess I haven&rsquo;t exercised yet, that&rsquo;ll probably invigorate me.</td>
</tr>

<tr>
<td class="org-left">4/27</td>
<td class="org-right">6:30</td>
<td class="org-right">6:20</td>
<td class="org-right">2:30</td>
<td class="org-right">9:00</td>
<td class="org-left">8 - actually felt rested for the first time in forever&#x2026;</td>
</tr>

<tr>
<td class="org-left">4/28</td>
<td class="org-right">6:50</td>
<td class="org-right">6:20</td>
<td class="org-right">2:10</td>
<td class="org-right">9:00</td>
<td class="org-left">5 - Slept ok, not as good as last night.</td>
</tr>

<tr>
<td class="org-left">4/29</td>
<td class="org-right">7:00</td>
<td class="org-right">6:00</td>
<td class="org-right">2:00</td>
<td class="org-right">9:00</td>
<td class="org-left">6 - Idk why I keep rating my sleep 6, but it felt like a 6 again.</td>
</tr>

<tr>
<td class="org-left">4/30</td>
<td class="org-right">7:00</td>
<td class="org-right">6:30</td>
<td class="org-right">2:00</td>
<td class="org-right">9:00</td>
<td class="org-left">6.5 - positive meh&#x2026;.</td>
</tr>

<tr>
<td class="org-left">5/1</td>
<td class="org-right">7:00</td>
<td class="org-right">6:00</td>
<td class="org-right">2:00</td>
<td class="org-right">9:00</td>
<td class="org-left">5 - had some major disturbances (i.e. bathroom) during the night, so I think that disrupted my sleep a fair bit.</td>
</tr>

<tr>
<td class="org-left">5/2</td>
<td class="org-right">7:30</td>
<td class="org-right">7:20</td>
<td class="org-right">1:30</td>
<td class="org-right">9:00</td>
<td class="org-left">7.5 - feel rested again! I think it may be time to try moving my sleep window back to 1:30 officially.</td>
</tr>

<tr>
<td class="org-left">5/3</td>
<td class="org-right">7:00</td>
<td class="org-right">6:45</td>
<td class="org-right">2:00</td>
<td class="org-right">9:00</td>
<td class="org-left">8 - I feel like this was my best sleep yet. Only one(?) wakeup afaik. Also, my body seems to be consistently anticipating my alarm now, as I wake up &lt;10 minutes before it. Incredible.</td>
</tr>

<tr>
<td class="org-left">5/4</td>
<td class="org-right">6:20</td>
<td class="org-right">5:35</td>
<td class="org-right">2:40</td>
<td class="org-right">9:00</td>
<td class="org-left">5 - Obviously went to bed a little late tonight, but I feel like the more major reason was that I was somewhat stressed going into bed, having not reached a good resolution with my research project, and I feel like most of my sleep was disturbed for that reason. I only got semi-decent sleep in the last hour or two. Also, I felt hot under the blankets, and my back was uncomfortable since I didn&rsquo;t do child pose before sleeping. Gotta remember to do those things.</td>
</tr>

<tr>
<td class="org-left">5/5</td>
<td class="org-right">7:00</td>
<td class="org-right">6:20</td>
<td class="org-right">2:00</td>
<td class="org-right">9:00</td>
<td class="org-left">6 - was definitely better than yesterday, but the reason it&rsquo;s not higher is the seeming cavalcade of garbage trucks in the morning&#x2026;I really need to have my headphones + brown noise handy, and also we just can&rsquo;t sleep with the windows open. The trucks could strike at any time.</td>
</tr>

<tr>
<td class="org-left">5/6</td>
<td class="org-right">8:00</td>
<td class="org-right">7:00</td>
<td class="org-right">1:40</td>
<td class="org-right">9:40</td>
<td class="org-left">7 - honestly, I felt a lot more grumpy when I woke up &#x2013; now realizing that maybe I didn&rsquo;t sleep too badly. Well that&rsquo;s good. :)</td>
</tr>

<tr>
<td class="org-left">5/7</td>
<td class="org-right">6:20</td>
<td class="org-right">5:50</td>
<td class="org-right">2:40</td>
<td class="org-right">9:00</td>
<td class="org-left">6 - stayed up too late, but the actual sleep wasn&rsquo;t terrible. A few wakeups / back discomfort.</td>
</tr>

<tr>
<td class="org-left">5/8</td>
<td class="org-right">7:15</td>
<td class="org-right">5:30</td>
<td class="org-right">1:45</td>
<td class="org-right">9:00</td>
<td class="org-left">4 - slept ok&#x2026;.</td>
</tr>

<tr>
<td class="org-left">5/9</td>
<td class="org-right">8:40</td>
<td class="org-right">7:00</td>
<td class="org-right">2:00</td>
<td class="org-right">10:40</td>
<td class="org-left">4 - ugh, this did not feel nice. For whatever reason, screens etc., I just didn&rsquo;t sleep well last night.</td>
</tr>

<tr>
<td class="org-left">5/10</td>
<td class="org-right">7:15</td>
<td class="org-right">6:45</td>
<td class="org-right">1:45</td>
<td class="org-right">9:00</td>
<td class="org-left">7 - yay, feel like I slept well :) Lil bit of tiredness to shake off, but hopefully going on a run will help w that!</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Last updated: 2021-07-15 Thu 17:02</p>
</div>
</body>
</html>
